# 2.5. Знаменитая цитата: найдите известное высказывание, которое вам понравилось.
# Выведите текст цитаты с именем автора. Результат должен выглядеть примерно так (включая кавычки):
# Albert Einstein once said, "A person who never made a mistake never tried anything new."
message = 'Albert Einstein once said, "A person who never made a mistake never tried anything new."'
print(message)