# 2.10. Добавление комментариев: выберите две программы из написанных вами и добавьте
# в каждую хотя бы один комментарий. Если вы не найдете, что написать в комментариях,
# потому что программы были слишком просты, добавьте свое имя и текущую дату в начало
# кода. Затем добавьте одно предложение с описанием того, что делает программа.
from datetime import datetime  #импортируем библеотеку datetime, чтобы работать с датой
name = "nikola"                #создаём переменную с именем
now = datetime.now()           #создаём переменную с датой, и добавляем в неё текущую дату
print(f"Здарово, {name.title()}! Сегодня уже {now}, давно не виделись._.")  #выводим сообщение, через f-строку