# 7.6. Три выхода: напишите альтернативную версию упражнения 7.4 или упражнения 7.5,
# в которой каждый пункт следующего списка встречается хотя бы один раз:
# • Завершение цикла по проверке условия в команде while.
# • Управление продолжительностью выполнения цикла в зависимости от переменной active.
# • Выход из цикла по команде break, если пользователь вводит значение 'quit'.
active = True
while active:
    age = input("Введите ваш возраст: ")
    if age == 'quit':
        break
    age = int(age)
    if age < 3:
        print("Вход бесплатный.")
    elif age <= 12:
        print("Стоимость билета - $10.")
    else:
        print("Стоимость билета - $15.")
    response = input("Хотите продолжить? (yes/no): ")
    if response == 'no':
        active = False
print("Спасибо за использование нашей программы!")