# 7.1. Прокат машин: напишите программу, которая спрашивает у пользователя, какую машину он бы хотел взять напрокат.
# Выведите сообщение с введенными данными (например, «Let me see if I can find you a Subaru”).
car = input('What car you want?')
print(f'Ok, we will searching {car.title()}')