# 3.7. Сокращение списка гостей: только что выяснилось, что новый обеденный стол привезти вовремя не успеют и
#   места хватит только для двух гостей.
# • Начните с программы из упражнения 3.6. Добавьте команду для вывода сообщения
# о том, что на обед приглашаются всего два гостя.
# • Используйте метод pop() для последовательного удаления гостей из списка до тех
# пор, пока в списке не останутся только два человека. Каждый раз, когда из списка
# удаляется очередное имя, выведите для этого человека сообщение о том, что вы сожалеете об отмене приглашения.
# • Выведите сообщение для каждого из двух человек, остающихся в списке. Сообщение должно подтверждать,
# что более раннее приглашение остается в силе.
# • Используйте команду del для удаления двух последних имен, чтобы список остался
# пустым. Выведите список, чтобы убедиться в том, что в конце работы программы
# список действительно не содержит ни одного элемента.
names = ['ксения', 'татьяна', 'вадим']
print(f'{names[0].title()}, приходи на обед?')
print(f'{names[0].title()}, не сможет придти на обед!')
names[0] = 'сеня'
print(f'{names[0].title()}, приходи на обед?')
print(f'{names[1].title()}, приходи на обед?')
print(f'{names[2].title()}, приходи на обед?')
print('Добавилось еще три места')
names.insert(0, 'юра')
names.insert(2, 'даша')
names.append('ваня')
print(f'{names[0].title()}, приходи на обед?')
print(f'{names[1].title()}, приходи на обед?')
print(f'{names[2].title()}, приходи на обед?')
print(f'{names[3].title()}, приходи на обед?')
print(f'{names[4].title()}, приходи на обед?')
print(f'{names[5].title()}, приходи на обед?')
print('Приглашения отправлены только двум гостям')
popped_name = names.pop()
print(f'{popped_name.title()}, извините вы не приглашены')
popped_name = names.pop()
print(f'{popped_name.title()}, извините вы не приглашены')
popped_name = names.pop()
print(f'{popped_name.title()}, извините вы не приглашены')
popped_name = names.pop()
print(f'{popped_name.title()}, извините вы не приглашены')
print(f'{names[0].title()}, вы все ещё приглашены')
print(f'{names[1].title()}, вы все ещё приглашены')
del names[0]
print(names)
del names[0]
print(names)