# 3.6. Больше гостей: вы решили купить обеденный стол большего размера. Дополнительные места позволяют пригласить на обед еще трех гостей.
# • Начните с программы из упражнения 3.4 или 3.5. Добавьте в конец программы
# команду print, которая выводит сообщение о расширении списка гостей.
# • Добавьте вызов insert() для добавления одного гостя в начало списка.
# • Добавьте вызов insert() для добавления одного гостя в середину списка.
# • Добавьте вызов append() для добавления одного гостя в конец списка.
# • Выведите новый набор сообщений с приглашениями — по одному для каждого
# участника, входящего в список.
names = ['ксения', 'татьяна', 'вадим']
print(f'{names[0].title()}, приходи на обед?')
print(f'{names[0].title()}, не сможет придти на обед!')
names[0] = 'сеня'
print(f'{names[0].title()}, приходи на обед?')
print(f'{names[1].title()}, приходи на обед?')
print(f'{names[2].title()}, приходи на обед?')
print('Добавилось еще три места')
names.insert(0, 'юра')
names.insert(2, 'даша')
names.append('ваня')
print(f'{names[0].title()}, приходи на обед?')
print(f'{names[1].title()}, приходи на обед?')
print(f'{names[2].title()}, приходи на обед?')
print(f'{names[3].title()}, приходи на обед?')
print(f'{names[4].title()}, приходи на обед?')
print(f'{names[5].title()}, приходи на обед?')