# 3.3. Собственный список: выберите свой любимый вид транспорта (например, мотоциклы
# или машины) и создайте список с примерами. Используйте свой список для вывода утверждений об элементах типа:
# «Я хотел бы купить мотоцикл Honda».
cars = ['toyota', 'honda', 'mersedes', 'lada']
print(f'Я хотел бы купить автомобиль {cars[0].title()}')
print(f'Я хотел бы купить автомобиль {cars[1].title()}')
print(f'Я хотел бы купить автомобиль {cars[2].title()}')
print(f'Я не хотел бы купить автомобиль {cars[3].title()}')
