# 3.5. Изменение списка гостей: вы только что узнали, что один из гостей прийти не сможет,
# поэтому вам придется разослать новые приглашения. Отсутствующего гостя нужно заменить кем-то другим.
# • Начните с программы из упражнения 3.4. Добавьте в конец программы команду
# print для вывода имени гостя, который прийти не сможет.
# • Измените список и замените имя гостя, который прийти не сможет, именем нового
# приглашенного.
# • Выведите новый набор сообщений с приглашениями — по одному для каждого
# участника, входящего в список.
names = ['ксения', 'татьяна', 'вадим']
print(f'{names[0].title()}, приходи на обед?')
print(f'{names[1].title()}, приходи на обед?')
print(f'{names[2].title()}, приходи на обед?')
print(f'{names[0].title()}, не сможет придти на обед!')
names[0] = 'сеня'
print(f'{names[0].title()}, приходи на обед?')
print(f'{names[1].title()}, приходи на обед?')
print(f'{names[2].title()}, приходи на обед?')