# 4.15. Анализ кода: выберите три программы, написанные в этой главе, и измените каждую
# в соответствии с рекомендациями PEP 8:
# • Используйте четыре пробела для каждого уровня отступов. Настройте текстовый
# редактор так, чтобы он вставлял четыре пробела при каждом нажатии клавиши табуляции,
# если это не было сделано ранее (за инструкциями обращайтесь к приложению Б).
# • Используйте менее 80 символов в каждой строке. Настройте редактор так, чтобы он
# отображал вертикальную черту в позиции 80-го символа.
# • Не злоупотребляйте пустыми строками в файлах программ.