# 4.7. Тройки: создайте список чисел, кратных 3, в диапазоне от 3 до 30.
# Выведите все числа своего списка в цикле for.
numbers = [i for i in range(3, 31, 3)]
print(numbers)