# 6.10. Любимые числа: измените программу из упражнения 6.2 (с. 114),
# чтобы для каждого человека можно было хранить более одного любимого числа.
# Выведите имя каждого человека в списке и его любимые числа.
person = {'nikola': [1, 2, 3, 4],
          'thierry': [12, 23, 33, 44],
          'tony': [10, 20, 30, 40],
          'jack': [19, 29, 39, 49]
          }
for key, value in person.items():
    print(f'{key.title()} very like numbers - {value}')