# 6.8. Домашние животные: создайте несколько словарей, имена которых представляют клички домашних животных.
# В каждом словаре сохраните информацию о виде животного и имени владельца.
# Сохраните словари в списке с именем pets.
# Переберите элементы списка.
# В процессе перебора выведите всю имеющуюся информацию о каждом животном.
kuga = {
    'name': 'nikola',
    'kind': 'cat'
}
cesar = {
    'name': 'kseniya',
    'kind': 'dog'
}
bars = {
    'name': 'vadim',
    'kind': 'tiger'
}
pets = [kuga, cesar, bars]
for pet in pets:
    print(pet)
