# 6.9. Любимые места: создайте словарь с именем favorite_places.
# Придумайте названия трех мест, которые станут ключами словаря,
# и сохраните для каждого человека от одного до трех любимых мест.
# Чтобы задача стала более интересной, опросите нескольких друзей и соберите реальные данные для своей программы.
# Переберите данные в словаре, выведите имя каждого человека и его любимые места.
favorite_places = {
    'olkhon': 'nikola',
    'phuket': 'sasha',
    'irkutsk': 'vadim'
}
for key, value in favorite_places.items():
    print(f'{value.title()} very like {key.title()}.')
