# 6.1. Человек: используйте словарь для сохранения информации об известном вам человеке.
# Сохраните имя, фамилию, возраст и город, в котором живет этот человек.
# Словарь должен содержать ключи с такими именами, как first_name, last_name, age и city.
# Выведите каждый фрагмент информации, хранящийся в словаре.
person = {'first_name': 'nikola',
          'last_name': 'paganini',
          'age': 30,
          'city': 'irkutsk'
          }
print(person['first_name'])
print(person['last_name'])
print(person['age'])
print(person['city'])