# 8.7. Альбом: напишите функцию make_album(), которая строит словарь с описанием музыкального альбома.
# Функция должна получать имя исполнителя и название альбома и возвращать словарь, содержащий эти два вида информации.
# Используйте функцию для создания трех словарей, представляющих разные альбомы.
# Выведите все возвращаемые значения, чтобы показать, что информация правильно сохраняется во всех трех словарях.
# Добавьте в make_album() дополнительный параметр для сохранения количества дорожек в альбоме,
# имеющий значение по умолчанию None.
# Если в строку вызова включено значение количества дорожек, добавьте это значение в словарь альбома.
# Создайте как минимум один новый вызов функции с передачей количества дорожек в альбоме.
def make_album(vocalist, album, quantity=None):
    if quantity:
        track = {'vocalist': vocalist, 'album': album, 'quantity': quantity}
    else:
        track = {'vocalist': vocalist, 'album': album}
    return track
print(make_album('eminem', 'in to the bridge'))
print(make_album('bob marley', 'children earth'))
print(make_album('2puc', 'kill me', 10))