# 1.3. Бесконечное мастерство: если бы вы были программистом с неограниченными возможностями, за какой проект
# вы бы взялись? Вы сейчас учитесь программировать. Если
# у вас имеется ясное представление о конечной цели, вы сможете немедленно применить
# свои новые навыки на практике; попробуйте набросать общие описания тех программ, над
# которыми вам хотелось бы поработать. Заведите «блокнот идей», к которому вы сможете обращаться каждый раз,
# когда собираетесь начать новый проект. Выделите пару минут
# и составьте описания трех программ, которые вам хотелось бы создать.